In [5]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series

In [6]:
series=[4,8,15,16,23,42]

In [7]:
result = pd.Series(series)

In [8]:
print(result)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2

In [9]:
var = [1,2,3,4,5,6,7,8,9,10]

In [10]:
result1 = pd.Series(var)

In [11]:
print(result1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3.

In [12]:
data = {'Name' : ['Alice' , 'Bob' , 'Claire'],
        'Age' : [25,30,27],
        'Gender' : ['female' , 'Male' , 'female']}

In [13]:
result3 = pd.DataFrame(data)

In [14]:
result3

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    Male
2  Claire   27  female

Q4.

What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a two-dimensional size mutable, potentially heterogeneous tabular data structure with labeled axes(rows and columns). Here data is aligned in a tabular fashion in rows and columns like in excel or SQL. Each column can contain different-different types of data types like string(object), int ,etc

Series is one dimensional labeled array in which one one paticular data type data holds. Means that it is homogeneous.It is similar to one column in dataframe.

In [15]:
data = {"Batch": 'Datascience masters',
        "Faculty": ["Sudh sir","Krish sir"],
        "Timing":8.00
        }

In [16]:
dataframe = pd.DataFrame(data)
dataframe

                 Batch    Faculty  Timing
0  Datascience masters   Sudh sir     8.0
1  Datascience masters  Krish sir     8.0

In [17]:
Series = pd.Series(data)
Series

Batch        Datascience masters
Faculty    [Sudh sir, Krish sir]
Timing                       8.0
dtype: object

Q5.

In [18]:
data = {
        'Name': ['Alice','Bob','Claire'],
        'Age' : [25,30,27],
        'Gender' : ['Female','Male','Femaile'],
        'Hobby' : ["Basketball","Cricket","Volleyball"]}

In [19]:
df = pd.DataFrame(data)

In [20]:
df

     Name  Age   Gender       Hobby
0   Alice   25   Female  Basketball
1     Bob   30     Male     Cricket
2  Claire   27  Femaile  Volleyball

Common functions like:

1. df.columns -- it shows the column names in dataframe
2. df.dtypes -- it shows the data type of a particular columns
3. df.head() -- it shows the first five records in a dataset
4. df.tail() -- it shows the last five record in a dataset
5. describe() -- provide summary of records in statiscal way

In [21]:
 df.head()

     Name  Age   Gender       Hobby
0   Alice   25   Female  Basketball
1     Bob   30     Male     Cricket
2  Claire   27  Femaile  Volleyball

In [22]:
df.tail()

     Name  Age   Gender       Hobby
0   Alice   25   Female  Basketball
1     Bob   30     Male     Cricket
2  Claire   27  Femaile  Volleyball

In [24]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series --
Size of the series is immutable but values of data is mutable

Dataframe --
Here both data and size if dataframe are mutable

Panel --
Panel is a 3D data stucture with heterogeneous data and Here Size and Data are both mutable

In [ ]:
***Q7. Create a DataFrame using multiple Series. Explain with an example.***

In [26]:
data1 = { 'Name' : ['Shailove' , 'yash' , 'Prajwal'],
         'Age' : ['22', '50' , '70'],
         'Gender' : ['Male' , 'Homo', 'Female']}

In [27]:
df = pd.DataFrame(data1)

In [28]:
df

       Name Age  Gender
0  Shailove  22    Male
1      yash  50    Homo
2   Prajwal  70  Female